# MultipleArcsMustOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..MultipleArcsMustOverlap Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Multiple arcs are supported only if they are concentric and form a circle with an overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultipleArcsMustOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultipleArcsMustOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultipleArcsMustOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace